In [85]:
#Importing Libraries
import pandas as pd 
import numpy as nd
import os

In [9]:
path = r'C:\Users\ankit\Desktop\DataAnalysisCF\DataImmersion\PythonFundamentals\Instacart Basket Analysis\02 Data'

In [234]:
#Importing Dataframes
df_prods = pd.read_csv(os.path.join(path,'Original Data','products.csv'),index_col = False)
df_ords = pd.read_csv(os.path.join(path,'Prepared Data','orders_wrangled.csv'),index_col = False)

## Mixed Datatype

In [3]:
# Creating DataFrame
df_test = pd.DataFrame()

In [95]:
# Dataframe with mixed datatype
df_test['mix']= ['a','b',1,True]

In [17]:
df_test

    mix
0     a
1     b
2     1
3  True

In [97]:
# Code to find column with mixed data type
for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [99]:
# Changing mixed datatpe to String datatype
df_test['mix'] = df_test['mix'].astype('str')

In [27]:
df_test.dtypes

mix    object
dtype: object

## 1.Consistency checks  df_prods dataframe

In [93]:
# Finding Column with Missing Values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [91]:
# Dataframe with missing values
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [53]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [59]:
df_prods.shape

(49693, 5)

In [65]:
df_nan.shape

(16, 5)

In [63]:
#Addressing missing values by removing them
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [69]:
df_prods_clean.shape

(49677, 5)

## Number of rows df_prods_clean dataframe should have 49693-16 = 49677 rows. Therefore Missing values addressed correctly.

In [77]:
# Finding Duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [75]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [79]:
df_dups.shape

(5, 5)

In [81]:
# Addressing Duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [83]:
df_prods_clean_no_dups.shape

(49672, 5)

## Number of rows in df_prods_clean dataframe should be 49677-5 = 49672. Duplicate values addressed correctly

## 2. Run the df.describe() function on your df_ords dataframe.

In [105]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

#### There are many missing values in the 'days_since_prior_order' column, as its count is lower than the other columns.d.

#### order_number' has min value as 1 and max value as 100. Q2 or median is 11. No discrepancies found.

#### 'days_since_prior_order' has min value as 0 and max as 30. Q2 or median is 7. No discrepancies found.

## 3. Check for mixed-type data in your df_ords dataframe.

In [111]:
df_ords.dtypes

Unnamed: 0                  int64
order_id                    int64
user_id                     int64
order_number                int64
order_day_of_week           int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [158]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)
else :
    print ("None of the columns have mix data")

None of the columns have mix data

#### No mixed type column in df_ords dataframe

## 5. Run a check for missing values in your df_ords dataframe.

In [132]:
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
order_day_of_week              0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

#### days_since_prior_order column has 206209 missing values. The value may be missing as these may be the first order.  As this data is important, it should not be removed.

#### Steps to address the issue:
#### 1. Check the order number to know if its 1st order.
#### 2. A flag variable has to be created

In [161]:
# creating a subset of missing values
df_nan2 = df_ords[df_ords['days_since_prior_order'].isnull()== True]

In [136]:
df_nan2

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [220]:
df_nan2['order_number'].value_counts()

order_number
1    206209
Name: count, dtype: int64

#### It is confirmed that order number is 1 for all the missing values in 'days_since_prior_order' column

## 6.Address the missing values using an appropriate method

In [206]:
# Checking if order number is 1
df_first_order = df_ords[df_ords['order_number'] == 1]

In [201]:
df_first_order.shape

(206209, 7)

##### 206209 rows has order number 1 and 206209 rows have missing values in 'days_since_prior_order' column. Therefore when order number is 1, there is no value in 'days_since_prior_order' column

In [191]:
df_ords['order_number'] == 1

0           True
1          False
2          False
3          False
4          False
           ...
3421078    False
3421079    False
3421080    False
3421081    False
3421082    False
Name: order_number, Length: 3421083, dtype: bool

In [245]:
# Adding a new column first_order as flag variable
df_ords['first_order']=df_ords['order_number'] == 1

In [195]:
df_ords

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,2539329,1,1,2,8,NaN,True
1,1,2398795,1,2,3,7,15.0,False
2,2,473747,1,3,3,12,21.0,False
3,3,2254736,1,4,4,7,29.0,False
4,4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0,False
3421079,3421079,1854736,206209,11,4,10,30.0,False
3421080,3421080,626363,206209,12,1,12,18.0,False
3421081,3421081,2977660,206209,13,1,12,7.0,False
3421082,3421082,272231,206209,14,6,14,30.0,False

In [197]:
df_ords['first_order'].value_counts()

first_order
False    3214874
True      206209
Name: count, dtype: int64

#### The True value count = 206209 which is same as missing values in 'days_since_prior_order' column. Missing values handled correctly.

## 7. Run a check for duplicate values in your df_ords data.

In [216]:
df_dups2 = df_ords[df_ords.duplicated()]

In [218]:
df_dups2

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, order_day_of_week, order_hour_of_day, days_since_prior_order, first_order]
Index: []

In [224]:
df_dups2.shape

(0, 8)

#### No duplicates found.

## 9.Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [230]:
# Exporting df_ords dataframe as "orders_checked.csv"
df_ords.to_csv(os.path.join(path, 'Prepared Data', 'orders_checked.csv'))

In [232]:
# Exporting df_prods_clean_no_dups dataframe as "products_checked.csv"
df_prods_clean_no_dups.to_csv(os.path.join(path, 'Prepared Data', 'products_checked.csv'))